# Series

In [6]:
import numpy as np
import pandas as pd

In [7]:
minha_lista = [10,20,30]
keys = ['a', 'b', 'c']

In [8]:
serie = pd.Series(minha_lista, keys)
serie

a    10
b    20
c    30
dtype: int64

In [9]:
serie['a']

10

In [10]:
array = np.array(minha_lista)

In [13]:
serie2 = pd.Series(array, keys)
serie2

a    10
b    20
c    30
dtype: int32

Mutiplicidade de dados

In [14]:
valores = np.array(["maria", 2, 4.5])

serie3 = pd.Series(valores, keys)
serie3

a    maria
b        2
c      4.5
dtype: object

In [15]:
serie3['b']

'2'

In [16]:
serie4 = pd.Series(np.array([sum, map, filter]))
serie4

0    <built-in function sum>
1              <class 'map'>
2           <class 'filter'>
dtype: object

Operacoes com Series

In [18]:

ser = pd.Series([1,2,3], ['Brasil', 'EUA', 'Canada'])
ser

Brasil    1
EUA       2
Canada    3
dtype: int64

In [20]:
ser2 = pd.Series([1,2,3], ['Canada', 'Portugal', 'EUA'])
ser2

Canada      1
Portugal    2
EUA         3
dtype: int64

In [22]:
ser2+ ser

Brasil      NaN
Canada      4.0
EUA         5.0
Portugal    NaN
dtype: float64

# DataFrames

In [23]:
matriz = np.random.randint(1, 101, (3,3))
matriz

array([[48, 51, 87],
       [83, 24, 89],
       [56, 46, 68]])

In [79]:
tabela = pd.DataFrame(matriz, index=['A', 'B', 'C'], columns=['Manaus', 'Sp', 'Rio'])

In [80]:
tabela

   Manaus  Sp  Rio
A      48  51   87
B      83  24   89
C      56  46   68

In [41]:
tabela[['Rio']]

   Rio
A   87
B   89
C   68

In [39]:
tabela.loc[['A']]

   Manaus  Sp  Rio
A      48  51   87

In [42]:
tabela["Curitiba"] = tabela['Rio'] + tabela['Sp']

In [43]:
tabela

   Manaus  Sp  Rio  Curitiba
A      48  51   87       138
B      83  24   89       113
C      56  46   68       114

In [44]:
tabela.drop("Curitiba", axis=1, inplace=True)
tabela

   Manaus  Sp  Rio
A      48  51   87
B      83  24   89
C      56  46   68

In [45]:
tabela.loc[['A', 'B'], ["Rio", "Manaus"]]

   Rio  Manaus
A   87      48
B   89      83

In [49]:
tabela.iloc[0:2,] #localizar por index

   Manaus  Sp  Rio
A      48  51   87
B      83  24   89

Fazendo filtros

In [51]:
#cedulas que forem maior que 50
tabela[tabela>50]

   Manaus    Sp  Rio
A     NaN  51.0   87
B    83.0   NaN   89
C    56.0   NaN   68

In [53]:
#filtrar > 50 em Sp
tabela[tabela["Sp"]>50]

   Manaus  Sp  Rio
A      48  51   87

In [56]:
#filtrar em Manaus < 80 e só mostrar essas classes do Rio

tabela[tabela["Manaus"]<80][["Rio"]]

   Rio
A   87
C   68

Condição multipla

In [58]:
#filtrar Manaus<80 e Rio < 80

tabela[ (tabela["Manaus"]<80) & (tabela["Rio"]<80)  ][["Manaus", "Rio"]]  # condicional OR ==> |

   Manaus  Rio
C      56   68

Usando indices

In [63]:
tabela.reset_index()

  index  Manaus  Sp  Rio
0     A      48  51   87
1     B      83  24   89
2     C      56  46   68

In [61]:
tabela # so altera a tabela original com inplace=true

   Manaus  Sp  Rio
A      48  51   87
B      83  24   89
C      56  46   68

In [81]:
novos_index =  "Ricos Medios Pobres".split()

tabela["Classe"] = novos_index

In [82]:
tabela

   Manaus  Sp  Rio  Classe
A      48  51   87   Ricos
B      83  24   89  Medios
C      56  46   68  Pobres

In [83]:
tabela.set_index("Classe", inplace=True)
tabela

        Manaus  Sp  Rio
Classe
Ricos       48  51   87
Medios      83  24   89
Pobres      56  46   68

Indices Multiniveis

In [95]:
outside = "G1 G1 G2 G2".split(" ")
inside = [1,1,2,2]

hier_index = list(zip(outside, inside)) #faz a junção de tuplas
hier_index

[('G1', 1), ('G1', 1), ('G2', 2), ('G2', 2)]

In [96]:
hier_index = pd.MultiIndex.from_tuples(hier_index) #transforma para Pandas
hier_index

MultiIndex([('G1', 1),
            ('G1', 1),
            ('G2', 2),
            ('G2', 2)],
           )

In [97]:
lista = np.zeros((4,1))
tabela2 = pd.DataFrame(lista, index = hier_index)
tabela2

        0
G1 1  0.0
   1  0.0
G2 2  0.0
   2  0.0

In [100]:
# --------------- Aplicacao pratica ---------

listaA = ["Amazonas", "Amazonas", "Pernambuco", "Pernambuco"]
listaB = ["Interior", "Capital", "Interior", "Capital"]

tuplas_index = list(zip(listaA, listaB))
tuplas_index = pd.MultiIndex.from_tuples(tuplas_index)

dadosAle = np.random.randint(30,101, (4,3))
dadosAle

array([[32, 65, 70],
       [38, 51, 30],
       [45, 69, 60],
       [68, 56, 30]])

In [102]:

tabelaReal = pd.DataFrame(dadosAle, index=tuplas_index, columns=["Segurança", "Saude", "Educação"])
tabelaReal

                     Segurança  Saude  Educação
Amazonas   Interior         32     65        70
           Capital          38     51        30
Pernambuco Interior         45     69        60
           Capital          68     56        30

In [103]:
tabelaReal.xs("Amazonas")

          Segurança  Saude  Educação
Interior         32     65        70
Capital          38     51        30

In [104]:
tabelaReal.index.names = ["Estado", "Divisão"]

In [105]:
tabelaReal

                     Segurança  Saude  Educação
Estado     Divisão
Amazonas   Interior         32     65        70
           Capital          38     51        30
Pernambuco Interior         45     69        60
           Capital          68     56        30